УТ.УчетЗадач/src/InformationRegisters/cbr_ПросроченныеДействияПоЗадачам/cbr_ПросроченныеДействияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ПросроченныеДействияПоЗадачам</name>
  <comment>Просроченные действия по задачам</comment>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.cbr_КонтрольНадЭтапамиЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ПросроченныеДействияПоЗадачам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Очищает все записи регистра.
Процедура ОчиститьЗаписиРегистра() Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

// Создать запись в регистр сведений
// Параметры:
//  Задача - ДокументСсылка.cbr_Задача
//  Пользователь - СправочникСсылка.Пользователи
//  Этап - СправочникСсылка.cbr_КонтрольНадЭтапамиЗадач.
Процедура ЗаписатьПросроченноеДействие(Задача, Пользователь, Этап) Экспорт
	РуководительПользователя = cbr_ОбработчикиФормыЗадачиВызовСервера.РуководительПользователя(Пользователь);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Этап = Этап;
	МенеджерЗаписи.Руководитель = РуководительПользователя;
	МенеджерЗаписи.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
